import 'package:flutter/material.dart';
import 'package:mzad_damascus/core/widget/app_bar/main_app_bar.dart';
import 'package:mzad_damascus/core/widget/text/app_text_widget.dart';
import 'dart:ui' as ui;
class PrivacyPolicyScreen extends StatefulWidget {
  const PrivacyPolicyScreen({super.key});

  @override
  State<PrivacyPolicyScreen> createState() => _PrivacyPolicyScreenState();
}

class _PrivacyPolicyScreenState extends State<PrivacyPolicyScreen> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(appBar: MainAppBar(title: ""), body: SingleChildScrollView(
      child: Directionality(
        textDirection: ui.TextDirection.rtl,
        child: Padding(
          padding: const EdgeInsets.symmetric(horizontal:  8.0),
          child: AppTextWidget(text: '''1 توضح سياسة الخصوصية لـ "مزاد دمشق" الطرق والآليات التي يمكننا من خلالها جمع وتخزين واستخدام وحماية المعلومات الشخصية الخاصة بك (وهي المعلومات التي يمكن التعرف عليك من خلالها)، وتعتبر قراءة سياسة الخصوصية هذه ومراجعتها أمرًا في غاية الأهمية لك.

2- لا تشكل المعلومات مجهولة المصدر معلومات شخصية، لأنه لا يمكن استخدامها لتحديد أي شخص، لذا نجمع المعلومات الشخصية عند استخدام تطبيق مزاد دمشق، أو المواقع والخدمات ذات الصلة به (بما في ذلك دون حصر، عند التسجيل، والشراء والبيع والتبادل و قريباً المشاركة في المزادات أو عند التواصل مع فريق دعم العملاء الخاص بنا).

ومن خلال تزويدنا بالمعلومات الشخصية الخاصة بك، فإنك توافق صراحةً على معالجتنا للمعلومات الشخصية الخاصة بك وفقًا لشروط سياسة الخصوصية.

3- يحق لنا تعديل سياسة الخصوصية في أي وقت عن طريق نشر النسخة المعدلة في الموقع الإلكتروني الخاص بمزاد دمشق، وتكون سياسة الخصوصية المعدلة سارية المفعول من تاريخ نشرها. ويعتبر استمرارك في استخدام تطبيق مزاد دمشق والمواقع الإلكترونية الخاصة به وبقية الخدمات بمثابة موافقة صريحة منك على سياساتنا المعدلة.
سياسة الخصوصية
تغطي سياسة الخصوصية المواضيع التالية:
1. المعلومات الشخصية التي نجمعها منك.
2. استخدامنا لمعلوماتك الشخصية.
3. استخدامك للمعلومات الشخصية الخاصة بك وبالمستخدمين الآخرين.
4. الوصول والمراجعة والتعديل للمعلومات الشخصية الخاصة بك.
5. ارتباطات موقع طرف ثالث.
6. الكوكيز.
7. يمنع استخدام الرسائل المزعجة والمخادعة.
8. حماية المعلومات الشخصية الخاصة بك.
9. كيفية الاتصال بنا للاستفسار حول سياسة الخصوصية.
عند تسجيلك على التطبيق أو الموقع، سوف يُطلب منك أن تقدم لنا بعض المعلومات الشخصية مثل اسمك وعنوانك وعنوان البريد الإلكتروني الخاص بك و رقم الهاتف ومعلومات أخرى مشابهة.
بالإضافة إلى ذلك، نحتاج للتحقق الأمني، وللتأكد من عدم كونك تنتحل شخصية شخص آخر، ربما نتحقق من رقم هاتفك وعنوان البريد الإلكتروني الخاص بك.
نحن نستخدم المعلومات الشخصية الخاصة بك لتوفير الخدمات و دعم العملاء لك , و لقياس و تحسين الخدكات التي نقدمها .
لن يتم استخدام معلوماتك الشخصية و بياناتك خارج التطبيق 
يمكننا استخدام التعليقات التي أدليت بها حول مزاد دمشق للتسويق للتطبيق.
يمكنك الوصول للمعلومات الشخصية الخاصة بك و مراجعتها في قسم "حسابي" , في التطبيق و الموقع .
اذا حدث أي تغيير في المعلومات الشخصية بأي شكل من الأشكال أو تم تقديمها بشكل غير صحيح في مزاد دمشق , يجب عليك فورا تحديث المعلومات الشخصية الخاصة بك إما من خلال التطبيق أو من خلال التواصل مع فريق الدعم الفني .
عند تلقيك لأي رسالة مزعجة , أو مخادعة بإمكانك التبليغ عبر التواصل معنا من خلال الضغط على المساعدة أو عبر الإيميل الخاص بنا :

support@mazaddimashq.com
كيفية الاتصال بنا للاستفسار حول سياسة الخصوصية :
اذا كان لديك أي أسئلة أو استفسارات حول جمع و استخدام المعلومات الشخصية الخاصة بك , يرجى الاتصال بفريق خدمة العملاء من الزر "المساعدة" , في الجزء السفلي من التطبيق .
''',maxLines: 1000,
      
          textAlign: TextAlign.right,
          ),
        ),
      ),
    ));
  }
}
